#include "std_lib_facilities.h"

int main()
{
    cout << "Пожалуста, введите значение с плаваищей точкой: ";
    int n, a, b;
    cin >> n;
    cout << "n == " << n
         << "\n n+1 == " << n + 1
         << "\n три раза по n == " << 3 * n
         << "\n два раза по n == " << n + n
         << "\n n в квадрате == " << n * n
         << "\n половинка n == " << double(n) / 2
         << "\n остаток от деления n%2 == " << n % 2
         << "\n корень квадратный из n == " << sqrt(double(n)) << '\n';
         a = n;
         b = n;
         if((a/b*b)+(a%b) == a)
          cout << "\n выполнить равенство";
         else
          cout << "\n нет равенства";
     return 0;
}